---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooLarge
source: html/69c3e2dc-e11e-7818-62a3-efdaede98d98.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.StandardHookBendDiameterTooLarge Property

Rebar Standard Hook Bend Diameter is too large.

## Syntax (C#)
```csharp
public static FailureDefinitionId StandardHookBendDiameterTooLarge { get; }
```